In [8]:
import pandas as pd

Loc is used to select rorws and columns by their label

iloc - index based integer location

In [9]:
x = pd.Series([1, 2, 3, 4, 5])

y = [1, 2, 3, 4, 5]

df = pd.DataFrame({
    'x': x,
    'y': y
})

In [10]:
type(y)
df

   x  y
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [11]:
rows_subset = df.iloc[0:5]
rows_subset

   x  y
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [12]:
row_2 = df.loc[2]
row_2

x    3
y    3
Name: 2, dtype: int64

In [13]:
r = rows_subset.loc[0:2]
r

   x  y
0  1  1
1  2  2
2  3  3

In [14]:
ir = rows_subset.iloc[0:2]
ir

   x  y
0  1  1
1  2  2

## create a specific data frame

In [15]:
row_3 = df.loc[df['x'] == 3]
row_3

   x  y
2  3  3

In [16]:
subset = df.loc[df['x'] > 2]
subset

   x  y
2  3  3
3  4  4
4  5  5

### Using Ranges of rows and columns

In [17]:
# select specific rows , columns 
subset1 = df.iloc[1:3, 0:1]
subset1

   x
1  2
2  3

In [18]:
dfname = pd.DataFrame({
    'Name': ['John', 'Jane', 'Jim', 'Jack', 'Jill'],
    'Age': [5, 4, 3, 2, 1],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
})

In [19]:
# Selecting a subset of rows and columns using labels of columns

subset2 = dfname.loc[0:2, ['Name', 'Age']]
subset2

   Name  Age
0  John    5
1  Jane    4
2   Jim    3

### Renaming

In [20]:
dfname

   Name  Age         City
0  John    5     New York
1  Jane    4  Los Angeles
2   Jim    3      Chicago
3  Jack    2      Houston
4  Jill    1      Phoenix

In [21]:
dfname.rename(columns={'Name': 'Naaw', 'Age': 'Weans', 'City': 'Seakinaiy'}, inplace=True)
dfname

   Naaw  Weans    Seakinaiy
0  John      5     New York
1  Jane      4  Los Angeles
2   Jim      3      Chicago
3  Jack      2      Houston
4  Jill      1      Phoenix

population = pd.series()

In [22]:
import cv2

ModuleNotFoundError: No module named 'cv2'

In [26]:
std_mrks = {'idrees':'40','shahid':'45','shahzeb':'35'}

std_grd = {45:'A',40:'B',35:'C'}

In [25]:
import pandas as pd

df = pd.DataFrame([std_mrks])
df

  idrees shahid shahzeb
0     40     45      35

In [28]:
df1 = pd.DataFrame([std_grd])
df1

  45 40 35
0  A  B  C

In [ ]:
def vary(data):
    n = len(data)
    mean = sum(data)/n



    variance = sum([data] - mean)/n
    return variance

In [ ]:
list = [1,3,5,7,9]

ss = [list] - 1
ss